app/views/songs/index.html.erb

SELECT  "songs".* FROM "songs" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "songs"
---
<ul>
  <%= raise Song.all.page(params).inspect %>