app/controllers/songs_controller.rb

  def index
    @songs = Song.all.page(params[:page])
---
SELECT  "songs".* FROM "songs" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "songs"